---
kind: method
id: M:Autodesk.Revit.DB.LinePattern.Dispose
source: html/56057ec9-f149-8e50-1168-4e7b61be72bc.htm
---
# Autodesk.Revit.DB.LinePattern.Dispose Method

Releases all resources used by the LinePattern

## Syntax (C#)
```csharp
public void Dispose()
```